var myCatalog = new Map();

function Product(productName, productPrise, productDiscount, productHtml, productImage, productOpisanie, productCharakteristick, productDostavka,) {
    this.productName = productName;
    this.productPrise = productPrise;
    this.productDiscount = productDiscount;
    this.productHtml = productHtml;
    this.productImage = productImage;
    this.productOpisanie = productOpisanie;
    this.productCharakteristick = productCharakteristick;
    this.productDostavka = productDostavka;
 };

 function addToCatalog(item){
     myCatalog.set(item.productName, [item.productHtml, item.productImage,]);
 }

var carob = new Product("Сироп семян дерева Кэроб", 7, 3, "carob.html", "../img/carob.jpg", "Дары солнечного Крита нашли свое воплощение в деревьях Кэроб. Его семена уникальны своей идентичностью и потому в древности они использовались для измерения веса - карат. Семена богаты витаминами и минералами. Сироп тонизирует, улучшает память и придает сил организму. Разливается в стеклянные бутылки объемом 250 мл. Рекомендуется хранить в темном прохлодном месте.", "<p>Сироп Кэроба, стеклання банка (Dorica Bottle), 250 ml. Производство: Крит. Цена: 7€. При оптовой поставке: 12 шт в коробке, 120 коробок в палетте 80 х 120 или 155 коробок в палетте 100 х 120.</p><ul><li>Био-производство</li><li>Первый отжим</li><li>Экстра-фильтрация</li></ul><p class='big_text'>При оптовой поставке:</p></div><table><tr><td>Количество товара в коробке</td><td>Размер палетты</td><td>Количество коробок в палетте</td></tr><tr><td>12</td><td>80 х 120</td><td>120</td></tr><tr><td>12</td><td>100 х 120</td><td>155</td></tr></table>", "<p class='big_text'>Доставка осуществляется транспортными компаниями. Оплата доставки не входит в стоимость и расчитыается индивидуально.</p>",);

var mythos5L = new Product("Оливковое масло Cretan Mythos Bio", 55, 5, "5l_green.html", "../img/5l_green.jpg", "Дары солнечного Крита нашли свое воплощение в оливковом масле Cretan Mythos Bio. Используется первый отжим и первоклассная фильтрация, благодаря чему, масло получается густым с насыщенным ароматом и ярким вкусом. Разливается в жестяные бутыли объемом 5000 мл. Рекомендуется хранить в темном прохладном месте.", "<p>Оливковое масло Organic Extra Virgin жестяная канистра (Tin Canister) объемом 5 lit. Производство Крит. Цена 55€. </p><ul><li>Био-производство</li><li>Первый отжим</li><li>Экстра-фильтрация</li></ul> <p class='big_text'>При оптовой поставке:</p><table><tr><td>Количество товара в коробке</td><td>Размер палетты</td><td>Количество коробок в палетте</td></tr><tr><td>4</td><td>80 х 120</td><td>55</td></tr><tr><td>4</td><td>100 х 120</td><td>75</td></tr></table>", "<p class='big_text'>Доставка осуществляется транспортными компаниями. Оплата доставки не входит в стоимость и расчитыается индивидуально.</p>",);

var vios = new Product("Оливковое масло VIOS", 14, 5, "vios.html", "../img/vios.jpg", "Дары солнечного Крита нашли свое воплощение в оливковом масле VIOS. Используется первый отжим и первоклассная фильтрация, благодаря чему, масло получается густым с насыщенным ароматом и ярким вкусом. Разливается в стеклянные бутылки объемом 500 мл и фасуется в подарочную упаковку. Рекомендуется хранить в темном прохладном месте.", "<p>Оливковое масло VIOS Organic Extra Virgin в стеклянной бутылке (Virginia Bottle) объемом 500 ml. Производство Крит. Цена 14€.</p><ul><li>Био-производство</li><li>Первый отжим</li><li>Экстра-фильтрация</li></ul><p class='big_text'>При оптовой поставке: </p><table><tr><td>Количество товара в коробке</td><td>Размер палетты</td><td>Количество коробок в палетте</td></tr><tr><td>12</td><td>80 х 120</td><td>55</td></tr><tr><td>12</td><td>100 х 120</td><td>75</td></tr></table>", "<p class='big_text'>Доставка осуществляется транспортными компаниями. Оплата доставки не входит в стоимость и расчитыается индивидуально.</p>",);

var carob2 = new Product("Сироп семян дерева Кэроб2", 7, 3, "carob.html", "../img/carob.jpg", "Дары солнечного Крита нашли свое воплощение в деревьях Кэроб. Его семена уникальны своей идентичностью и потому в древности они использовались для измерения веса - карат. Семена богаты витаминами и минералами. Сироп тонизирует, улучшает память и придает сил организму. Разливается в стеклянные бутылки объемом 250 мл. Рекомендуется хранить в темном прохлодном месте.", "<p>Сироп Кэроба, стеклання банка (Dorica Bottle), 250 ml. Производство: Крит. Цена: 7€. При оптовой поставке: 12 шт в коробке, 120 коробок в палетте 80 х 120 или 155 коробок в палетте 100 х 120.</p><ul><li>Био-производство</li><li>Первый отжим</li><li>Экстра-фильтрация</li></ul><p class='big_text'>При оптовой поставке:</p></div><table><tr><td>Количество товара в коробке</td><td>Размер палетты</td><td>Количество коробок в палетте</td></tr><tr><td>12</td><td>80 х 120</td><td>120</td></tr><tr><td>12</td><td>100 х 120</td><td>155</td></tr></table>", "<p class='big_text'>Доставка осуществляется транспортными компаниями. Оплата доставки не входит в стоимость и расчитыается индивидуально.</p>",);

var mythos5L2 = new Product("Оливковое масло Cretan Mythos Bio2", 55, 5, "5l_green.html", "../img/5l_green.jpg", "Дары солнечного Крита нашли свое воплощение в оливковом масле Cretan Mythos Bio. Используется первый отжим и первоклассная фильтрация, благодаря чему, масло получается густым с насыщенным ароматом и ярким вкусом. Разливается в жестяные бутыли объемом 5000 мл. Рекомендуется хранить в темном прохладном месте.", "<p>Оливковое масло Organic Extra Virgin жестяная канистра (Tin Canister) объемом 5 lit. Производство Крит. Цена 55€. </p><ul><li>Био-производство</li><li>Первый отжим</li><li>Экстра-фильтрация</li></ul> <p class='big_text'>При оптовой поставке:</p><table><tr><td>Количество товара в коробке</td><td>Размер палетты</td><td>Количество коробок в палетте</td></tr><tr><td>4</td><td>80 х 120</td><td>55</td></tr><tr><td>4</td><td>100 х 120</td><td>75</td></tr></table>", "<p class='big_text'>Доставка осуществляется транспортными компаниями. Оплата доставки не входит в стоимость и расчитыается индивидуально.</p>",);

var vios2 = new Product("Оливковое масло VIOS2", 14, 5, "vios.html", "../img/vios.jpg", "Дары солнечного Крита нашли свое воплощение в оливковом масле VIOS. Используется первый отжим и первоклассная фильтрация, благодаря чему, масло получается густым с насыщенным ароматом и ярким вкусом. Разливается в стеклянные бутылки объемом 500 мл и фасуется в подарочную упаковку. Рекомендуется хранить в темном прохладном месте.", "<p>Оливковое масло VIOS Organic Extra Virgin в стеклянной бутылке (Virginia Bottle) объемом 500 ml. Производство Крит. Цена 14€.</p><ul><li>Био-производство</li><li>Первый отжим</li><li>Экстра-фильтрация</li></ul><p class='big_text'>При оптовой поставке: </p><table><tr><td>Количество товара в коробке</td><td>Размер палетты</td><td>Количество коробок в палетте</td></tr><tr><td>12</td><td>80 х 120</td><td>55</td></tr><tr><td>12</td><td>100 х 120</td><td>75</td></tr></table>", "<p class='big_text'>Доставка осуществляется транспортными компаниями. Оплата доставки не входит в стоимость и расчитыается индивидуально.</p>",);

addToCatalog(vios);
addToCatalog(carob);
addToCatalog(mythos5L);
addToCatalog(vios2);
addToCatalog(carob2);
addToCatalog(mythos5L2);


var catalogH1 = document.getElementById('catalogH1');
catalogH1.innerHTML = 'Каталог';
var footer = document.getElementById('footer');
footer.innerHTML = '&copy; Все права защищены.';
var catalog = document.getElementById('catalog');
for (i of myCatalog.keys()){
    catalog.insertAdjacentHTML('beforeend','<a href="' + myCatalog.get(i)[0] + '"><img src="' + myCatalog.get(i)[1] + '" alt="' + myCatalog.get(i)[0] + '" height="200" width="150"><br>Подробнее</a>');
}
