//Задание 1
var devaNumber = {};
var n = Number(prompt('Введите число от 0 до 999 включительно: ', 245));

function devastator(devaNumber, n) {
    var s = Math.trunc(n / 100);
    var d = Math.trunc((n - s * 100) / 10);
    var e = n % 10;
    devaNumber = {
        'Единицы': e,
        'Десятки': d,
        'Сотни': s,
    };
    return devaNumber;
}

if (n >= 0 && n < 1000){
    console.log(devastator(devaNumber, n));
}
else {
    console.log('Введенное число не входит в отезок от 0 до 999 включительно!');
    console.log(devaNumber);
}

//Задание 2
/* Задумка: реализовать массив с координатами игрока. Номер элемета массива - как номер хода. Реализовать функцию генерации случайного игрового поля (случайные координаты ключа, выхода и игрока.).
*/

//Задание 3
/*Задумка: реализовать многомерный массив с вопросами, где последний элемент каждой строки ответ на данный вопрос. Выводить элементы вопроса и вариантов ответа, сравнивать с верным ответом.
*/
var questions = [
    ['Вопрос №1: 2 + 2 * 2 = ?', 3, 6, 8, 12, 2],
    ['Вопрос №2: Ближайшая к нам Звезда?', 'Вега', 'Бетельгейзе', 'Солнце', 'Альфа Центравра', 3],
    ['Вопрос №3: Откуда родом был гладиатор Спартак?', 'Македонии', 'Капуи', 'Фракии', 'Галии', 3],
    ['Вопрос №4: Сколько оловянных солдатиков лежало в картонной коробке в сказке Андерсона "Стойкий оловянный солдатик"?', 25, 20, 33, 49, 1],
    ['Вопрос №5: Слово "казак" тюрского происхождения. Что в переводе оно означает?', 'Степной воин', 'Истинный воин', 'Русский человек', 'Вольный человек', 4],
    ['Вопрос №6: Лучшие изделия из булата изготавливались в ?', 'США', 'Англии', 'Индии', 'Финикии', 3],
    ['Вопрос №7: Синхрофазотнон используется как ?', 'Мощная установка для ядерных исследований', 'Установка для запуска ракет', 'Установка для работы генератора на гидроэлектростанции', 'Устройство разогрева пищи в микрофолновых печах', 1],
    ['Вопрос №8: Один киловатт примерно соответствует мощности такого количества лошадей', 'Двух', 'Трех', 'Пяти', 'Одной', 1],
    ['Вопрос №9: Сплав меди, алюминия, магния и марганца называется', 'Касторка', 'Амальгама', 'Дюралюмин', 'Титан', 3],
    ['Вопрос №10: "Бугорчатка" - это простонародное название следующей болезни: ', 'Чума', 'Туберкулез', 'Сифилис', 'Проказа', 2],
    ['Вопрос №11: Этот вид бабочек имеет кричать и стонать:', 'Королёк', 'Махаон', 'Златоглазка', 'Мертвая голова', 4],
    ['Вопрос №12: В этот океан впадает Азовское море.', 'Северный ледовитый', 'Тихий', 'Атлантический', 'Южный', 3],
    ['Вопрос №13: Тип лавого потока, дающего после затвердевания неровную, растрескавшуюся поверхность, называется:', 'Ах-ах', 'Ох-ох', 'Ай-ай', 'Ой-ой', 1],
    ['Вопрос №14: Как звали отца библейского царя Соломона?', 'Соломон старший', 'Давид', 'Голиаф', 'Ной', 2],
    ['Вопрос №15: Какая книга была самая читаемая на Руси?', 'Русская Правда', 'Домострой', 'Библия', 'Букварь', 4],
];
var prises = [
    '100 рублей!',
    '200 рублей!',
    '300 рублей!',
    '500 рублей!',
    '1 000 рублей!',
    '2 000 рублей!',
    '4 000 рублей!',
    '8 000 рублей!',
    '16 000 рублей!',
    '32 000 рублей!',
    '64 000 рублей!',
    '125 000 рублей!',
    '250 000 рублей!',
    '500 000 рублей!',
    '1 000 000 рублей!',
];
for (i = 0; i <= questions.length; i++){
    if (i ==  questions.length){
        alert('Ура! Вы выиграли миллион! На этом игра завершается!');
    }
    else{
        var x = Number(prompt(questions[i][0] + '\n1:    ' + questions[i][1] + '\n2:    ' + questions[i][2] + '\n3:    ' + questions[i][3] + '\n4:    ' + questions[i][4]));

        if (x == questions[i][5]){
            alert('Правильный ответ! Вы выиграли ' + prises[i]);
        }
        else{
            alert('Увы! Ответ не верный! Вы выбываете из игры!');
            if (i >= 9){
                alert('Увы! Ваш выигрыш составил 32 000 рублей!');
            }
            else if( i >= 4){
                alert('Увы! Ваш выигрыш составил 1 000 рублей!');
            }
            break;
        }
    }
}


// Задание 4 + 5
/*Попытка перевести все на объекты провалилась.  Эффективнее корзину использовать как массив или множество объектов (чувствуется нехватка знаний). Товары можно генерировать как объекты. Здесь в объект товара добавлен элемент "количество на складе", однако эффективнее завести отдельный массив "склад" и хранить там данные о количестве товара в наличии. Можно создать функцию "купить товар", которая будет обнулять массив корзины и вычитать количество проданного товара из объекта товара (склада в дальнейшем).
*/
function Product(productName, productPrise, lotInStock, productDiscount) {
    this.productName = productName;
    this.productPrise = productPrise;
    this.lotInStock = lotInStock;
    this.productDiscount = productDiscount;
};

/*function Trash(productName, productPrise, countInBucket, productDiscount){
    this.productName = productName;
    this.productPrise = productPrise;
    this.countInBucket = countInBucket;
    this.productDiscount = productDiscount;
}*/

function addToTrash(item, count){
    myTrash.push([item.productName,
    item.productPrise,
    count,
    item.productDiscount,]);
}

function countBasketPrice(){
    var sum = 0;
    for (i = 0; i < myTrash.length; i++){
        sum += (myTrash[i][1] - myTrash[i][1] / 100 * myTrash[i][3]) * myTrash[i][2];
    }
    return sum;
}

//var myTrash = new Trash;
var myTrash = new Array();

var boots = new Product('boots', 15, 45, 5,);
var shorts = new Product('shorts', 20, 30, 10,);

addToTrash(boots, 3);
addToTrash(shorts, 4);
console.log(myTrash);
console.log(countBasketPrice());
